html/es6/es6.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ECMAScript 6 简明教程</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="content">
<h1 class="title">ECMAScript 6 简明教程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">let、const 和 block 作用域</a></li>
<li><a href="#sec-2">箭头函数</a></li>
<li><a href="#sec-3">函数参数默认值</a></li>
<li><a href="#sec-4">Spread/Rest 操作符</a></li>
<li><a href="#sec-5">对象词法扩展</a></li>
<li><a href="#sec-6">二进制和八进制的字面量</a></li>
<li><a href="#sec-7">对象和数组解构</a></li>
<li><a href="#sec-8">对象超类</a></li>
<li><a href="#sec-9">模板语法和分隔符</a></li>
<li><a href="#sec-10">for&#x2026;of VS for&#x2026;in</a></li>
<li><a href="#sec-11">Map 和 WeakMap</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">let、const 和 block 作用域</h2>
<div class="outline-text-2" id="text-1">
<p>
let 允许创建块级作用域，ES6 推荐在函数中使用 let 定义变量，而非 var：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">a</span> = 2;
{
  <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">a</span> = 3;
  console.log(a); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">3</span>
}
console.log(a); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">2</span>
</pre>
</div>

<p>
同样在块级作用域有效的另一个变量声明方式是 const，它可以声明一个常量．注意：　ES6 中， const 声明的常量类似于指针 <b>它指向某个引用</b> 也就是说这个常量的属性并非一成不变的，如：
</p>

<div class="org-src-container">

<pre class="src src-js">{
    <span style="color: #00ffff;">const</span> <span style="color: #eedd82;">ARR</span> = [5, 6];
    ARR.push(7);
    console.log(ARR); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">[5,6,7]</span>
    ARR = 10; <span style="color: #ff4500;">// </span><span style="color: #ff4500;">TypeError</span>
}
</pre>
</div>

<p>
有几个点需要注意：
</p>
<ul class="org-ul">
<li>let 关键词声明的变量不具备 <b>变量提升</b> 特性
</li>
<li>let 和 const 声明只在最靠近的一个块中（ <b>花括号内</b> ）有效
</li>
<li>当使用常量 const 声明时，请使用 <b>大写变量</b> 如 CAPITAL _ CASING
</li>
<li>const 在 <b>声明时必须被赋值</b> 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">箭头函数</h2>
<div class="outline-text-2" id="text-2">
<p>
ES6 中，箭头函数就是函数的一种简写形式， <b>使用括号包裹参数，跟随一个 =&gt;，紧接着是函数体</b> ：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">var getPrice = function () {</span>
<span style="color: #ff4500;">//     </span><span style="color: #ff4500;">return 4.55;</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">};</span>

<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Implementation with Arrow Function</span>
<span style="color: #00ffff;">var</span> <span style="color: #eedd82;">getPrice</span> = () =&gt; 4.55;

console.log(getPrice()) <span style="color: #ff4500;">// </span><span style="color: #ff4500;">4.55</span>
</pre>
</div>

<p>
需要注意的是，上面例子中的getPrice箭头函数采用了 <b>简洁函数体，它不需要 return 语句</b> 下面这个例子使用的是正常函数体：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">arr</span> = [<span style="color: #ffa07a;">'apple'</span>, <span style="color: #ffa07a;">'banana'</span>, <span style="color: #ffa07a;">'orange'</span>];

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">breakfast</span> = arr.map(fruit =&gt; {
    <span style="color: #00ffff;">return</span> fruit + <span style="color: #ffa07a;">'s'</span>;
});

console.log(breakfast); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">apples bananas oranges</span>
</pre>
</div>

<p>
当然，箭头函数不仅仅是让代码变得简洁， <b>函数中this总是绑定总是指向对象自身</b> 具体可以看看下面几个例子：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #87cefa;">Person</span>() {
    <span style="color: #7fffd4;">this</span>.age = 0;

    setInterval(<span style="color: #00ffff;">function</span> growUp() {
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22312;&#38750;&#20005;&#26684;&#27169;&#24335;&#19979;&#65292;growUp() &#20989;&#25968;&#30340; this &#25351;&#21521; window &#23545;&#35937;</span>
        <span style="color: #7fffd4;">this</span>.age++;
    }, 1000);
}
<span style="color: #00ffff;">var</span> <span style="color: #eedd82;">person</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Person</span>();
</pre>
</div>

<p>
所以经常需要使用一个变量来保存 this，然后在 growUp 函数中引用：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #87cefa;">Person</span>() {
    <span style="color: #00ffff;">var</span> <span style="color: #eedd82;">self</span> = <span style="color: #7fffd4;">this</span>;
    self.age = 0;

    setInterval(<span style="color: #00ffff;">function</span> growUp() {
        self.age++;
    }, 1000);
}
</pre>
</div>

<p>
而使用箭头函数可以省却这个麻烦：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #87cefa;">Person</span>() {
    <span style="color: #7fffd4;">this</span>.age = 0;

    setInterval(() =&gt; {
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">|this| &#25351;&#21521; person &#23545;&#35937;</span>
        <span style="color: #7fffd4;">this</span>.age++;
    }, 1000);
}

<span style="color: #00ffff;">var</span> <span style="color: #eedd82;">person</span> = <span style="color: #00ffff;">new</span> <span style="color: #98fb98;">Person</span>();
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">函数参数默认值</h2>
<div class="outline-text-2" id="text-3">
<p>
ES6 中允许你对函数参数设置默认值：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">getFinalPrice</span> = (price, tax=0.7) =&gt; price + price * tax;
console.log(getFinalPrice(500)); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">850</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Spread/Rest 操作符</h2>
<div class="outline-text-2" id="text-4">
<p>
Spread/Rest 操作符指的是 <b>&#x2026;</b> ，具体是 Spread 还是 Rest 需要看上下文语境：
</p>

<ul class="org-ul">
<li>当被用于迭代器中时，它是一个 <b>Spread</b> 操作符：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #87cefa;">foo</span>(<span style="color: #eedd82;">x</span>, <span style="color: #eedd82;">y</span>, <span style="color: #eedd82;">z</span>) {
    console.log(x, y, z);
}

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">arr</span> = [1, 2, 3];
foo(...arr); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">1 2 3</span>
</pre>
</div>

<ul class="org-ul">
<li>当被用于函数形参时，是一个 <b>Rest</b> 操作符：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #87cefa;">foo</span>(...args) {
  console.log(args);
}
foo( 1, 2, 3, 4, 5); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">[1, 2, 3, 4, 5]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">对象词法扩展</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>允许 <b>声明在对象字面量时使用简写语法</b> ，来初始化属性变量和函数的定义方法
</li>
<li>允许在 <b>对象属性中进行计算操作</b> ：
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #87cefa;">getCar</span>(<span style="color: #eedd82;">make</span>, <span style="color: #eedd82;">model</span>, <span style="color: #eedd82;">value</span>) {
    <span style="color: #00ffff;">return</span> {
        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#31616;&#20889;&#21464;&#37327;</span>
        make, <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#31561;&#21516;&#20110; make: make</span>
        model, <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#31561;&#21516;&#20110; model: model</span>
        value, <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#31561;&#21516;&#20110; value: value</span>

        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#23646;&#24615;&#21487;&#20197;&#20351;&#29992;&#34920;&#36798;&#24335;&#35745;&#31639;&#20540;</span>
        [<span style="color: #ffa07a;">'make'</span> + make]: <span style="color: #7fffd4;">true</span>,

        <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#24573;&#30053; `function` &#20851;&#38190;&#35789;&#31616;&#20889;&#23545;&#35937;&#20989;&#25968;</span>
        depreciate() {
            <span style="color: #7fffd4;">this</span>.value -= 2500;
        }
    };
}

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">car</span> = getCar(<span style="color: #ffa07a;">'Barret'</span>, <span style="color: #ffa07a;">'Lee'</span>, 40000);
console.log(car)
</pre>
</div>

<pre class="example">
output: {
    make: 'Barret',
    model:'Lee',
    value: 40000,
    makeKia: true,
    depreciate: function()
}
</pre>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">二进制和八进制的字面量</h2>
<div class="outline-text-2" id="text-6">
<p>
支持二进制和八进制的字面量，通过在数字前面添加 <b>0o</b> 或者 <b>0O</b> 即可将其转换为八进制值：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">oValue</span> = 0o10;
console.log(oValue); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">8</span>

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">bValue</span> = 0b10; <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#20108;&#36827;&#21046;&#20351;&#29992; `0b` &#25110;&#32773; `0B`</span>
console.log(bValue); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">2</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">对象和数组解构</h2>
<div class="outline-text-2" id="text-7">
<p>
解构可以 <b>避免在对象赋值时产生中间变量</b> ：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #87cefa;">foo</span>() {
    <span style="color: #00ffff;">return</span> [1, 2, 3];
}
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">arr</span> = foo(); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">[1,2,3]</span>
console.log(arr);

<span style="color: #00ffff;">let</span> [<span style="color: #eedd82;">a</span>, <span style="color: #eedd82;">b</span>, <span style="color: #eedd82;">c</span>] = foo();
console.log(a, b, c); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">1 2 3</span>

<span style="color: #00ffff;">function</span> <span style="color: #87cefa;">bar</span>() {
    <span style="color: #00ffff;">return</span> {
        x: 4,
        y: 5,
        z: 6
    };
}
<span style="color: #00ffff;">let</span> {
    x: x,
    y: y,
    z: z
} = bar();
console.log(x, y, z); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">4 5 6</span>
</pre>
</div>

<pre class="example">
[1, 2, 3]
1 2 3
4 5 6
</pre>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">对象超类</h2>
<div class="outline-text-2" id="text-8">
<p>
允许在对象中使用 <b>super</b> 方法：
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">var</span> <span style="color: #eedd82;">parent</span> = {
    foo() {
        console.log(<span style="color: #ffa07a;">"Hello from the Parent"</span>);
    }
}

<span style="color: #00ffff;">var</span> <span style="color: #eedd82;">child</span> = {
    foo() {
        <span style="color: #00ffff;">super</span>.foo();
        console.log(<span style="color: #ffa07a;">"Hello from the Child"</span>);
    }
}

Object.setPrototypeOf(child, parent);
child.foo(); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Hello from the Parent</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">Hello from the Child</span>
</pre>
</div>

<pre class="example">
Hello from the Parent
Hello from the Child
</pre>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">模板语法和分隔符</h2>
<div class="outline-text-2" id="text-9">
<p>
ES6 中有一种十分简洁的方法组装一堆字符串和变量：
</p>
<ul class="org-ul">
<li><b>${ &#x2026; }</b> 用来渲染一个变量
</li>
<li><b>`</b> 作为分隔符
</li>
</ul>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">user</span> = <span style="color: #ffa07a;">'Barret'</span>;
console.log(<span style="color: #ffa07a;">`Hi ${user}!`</span>); <span style="color: #ff4500;">// </span><span style="color: #ff4500;">Hi Barret!</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">for&#x2026;of VS for&#x2026;in</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><b>for&#x2026;of</b> 用于遍历一个 <b>迭代器</b> 如数组：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">nicknames</span> = [<span style="color: #ffa07a;">'di'</span>, <span style="color: #ffa07a;">'boo'</span>, <span style="color: #ffa07a;">'punkeye'</span>];
nicknames.size = 3;
<span style="color: #00ffff;">for</span> (<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">nickname</span> of nicknames) {
    console.log(nickname);
}
</pre>
</div>

<pre class="example">
di
boo
punkeye
</pre>

<ul class="org-ul">
<li><b>for&#x2026;in</b> 用来遍历 <b>对象中的属性</b> ：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">nicknames</span> = [<span style="color: #ffa07a;">'di'</span>, <span style="color: #ffa07a;">'boo'</span>, <span style="color: #ffa07a;">'punkeye'</span>];
nicknames.size = 3;
<span style="color: #00ffff;">for</span> (<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">nickname</span> <span style="color: #00ffff;">in</span> nicknames) {
    console.log(nickname);
}
</pre>
</div>

<pre class="example">
0
1
2
</pre>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Map 和 WeakMap</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
